{
    "apple": "A round fruit with red, yellow, or green skin and crisp flesh.",
    "banana": "A long curved fruit with a yellow skin and soft sweet flesh.",
    "computer": "An electronic device for storing and processing data.",
    "dictionary": "A book or electronic resource that lists words and their meanings.",
    "elephant": "A very large animal with a long trunk and tusks.",
    "flower": "The seed-bearing part of a plant.",
    "guitar": "A musical instrument with strings.",
    "happiness": "The state of being happy.",
    "internet": "A global computer network.",
    "jungle": "An area of land overgrown with dense forest and tangled vegetation.",
    "knowledge": "Facts, information, and skills acquired through experience or education.",
    "language": "The method of human communication.",
    "mountain": "A large natural elevation of the earth's surface.",
    "notebook": "A book with blank pages for writing notes.",
    "ocean": "A very large expanse of sea.",
    "python": "A high-level programming language.",
    "question": "A sentence worded to elicit information.",
    "rainbow": "An arch of colors visible in the sky.",
    "sunshine": "Direct sunlight unbroken by cloud.",
    "technology": "The application of scientific knowledge for practical purposes.",
    "algorithm": "A step-by-step procedure for solving a problem or accomplishing a task.",
    "biology": "The study of living organisms and their interactions.",
    "climate": "The weather conditions prevailing in an area over a long period.",
    "data": "Facts and statistics collected together for reference or analysis.",
    "ecology": "The study of how organisms interact with their environment.",
    "festival": "A day or period of celebration, typically for religious reasons.",
    "gravity": "The force that attracts objects toward one another.",
    "hydrogen": "The lightest chemical element, colorless, odorless gas.",
    "innovation": "The introduction of new methods, ideas, or products.",
    "journey": "An act of traveling from one place to another.",
    "kinetic": "Relating to or resulting from motion.",
    "lunar": "Relating to the moon.",
    "molecule": "A group of atoms bonded together.",
    "nutrition": "The process of providing or obtaining food necessary for health and growth.",
    "oxygen": "A colorless, odorless reactive gas, vital for living organisms.",
    "particle": "A minute portion of matter.",
    "quantum": "The smallest discrete unit of a phenomenon.",
    "robot": "A machine capable of carrying out complex tasks automatically.",
    "satellite": "An artificial body placed in orbit around the earth or other planet.",
    "telescope": "An optical instrument designed to make distant objects appear closer.",
    "universe": "All existing matter and space considered as a whole.",
    "vaccine": "A substance used to stimulate the production of antibodies for immunity.",
    "website": "A location on the World Wide Web containing interconnected webpages.",
    "xenon": "A chemical element, a colorless, odorless, inert gas.",
    "yoga": "A Hindu spiritual and physical discipline.",
    "zenith": "The highest point reached by a celestial object.",
    "acoustic": "Relating to sound or the sense of hearing.",
    "bacteria": "Microscopic single-celled organisms lacking a nucleus.",
    "calendar": "A chart showing the days, weeks, and months of a year.",
    "database": "A structured set of data held in a computer.",
    "ecosystem": "A biological community of interacting organisms and their environment.",
    "fashion": "A popular or the latest style of clothing, hair, decoration, or behavior.",
    "genome": "The complete set of genes or genetic material in an organism.",
    "horizon": "The line at which the earth's surface and the sky appear to meet.",
    "insulin": "A hormone produced in the pancreas regulating glucose levels.",
    "jazz": "A type of music characterized by improvisation and syncopation.",
    "kangaroo": "A large marsupial native to Australia.",
    "library": "A building containing collections of books for reading or borrowing.",
    "microscope": "An instrument used to view objects too small for the naked eye.",
    "nostalgic": "Feeling or inspiring a wistful affection for the past.",
    "orbit": "The curved path of an object around a star, planet, or moon.",
    "polymer": "A substance with a molecular structure built up from similar units.",
    "quantum": "The smallest discrete unit of a phenomenon.",
    "resonance": "The quality of being deep, full, and reverberating.",
    "symphony": "An elaborate musical composition for full orchestra.",
    "tornado": "A violent rotating column of air extending from a thunderstorm to the ground.",
    "utopia": "An imagined place or state of things in which everything is perfect.",
    "volcano": "A mountain or hill with a crater through which lava, rock, and gas erupt.",
    "wilderness": "An uncultivated, uninhabited, and inhospitable region.",
    "xylophone": "A musical instrument played by striking wooden bars with mallets.",
    "yearn": "To have an intense feeling of longing for something.",
    "zodiac": "A belt of the heavens divided into twelve equal parts named after constellations.",
    "autumn": "The season between summer and winter, also called fall.",
    "blueprint": "A design plan or technical drawing.",
    "coral": "A hard, stony substance secreted by certain marine polyps.",
    "democracy": "A form of government in which the people have the authority to deliberate and decide legislation.",
    "equation": "A statement that the values of two mathematical expressions are equal.",
    "frequency": "The rate at which something occurs over a particular period of time.",
    "galaxy": "A system of millions or billions of stars, together with gas and dust.",
    "heritage": "Features belonging to the culture of a particular society.",
    "illusion": "A false perception or belief; a deceptive appearance or impression.",
    "justice": "The quality of being fair and reasonable.",
    "kilowatt": "A unit of power equal to one thousand watts.",
    "latitude": "The angular distance of a place north or south of the earth's equator.",
    "metaphor": "A figure of speech in which a word is applied to an object to which it is not literally applicable.",
    "nucleus": "The central and most important part of an object or group.",
    "oscillate": "Move or swing back and forth in a regular rhythm.",
    "paradigm": "A typical example or pattern of something; a model.",
    "quotient": "A result obtained by dividing one quantity by another.",
    "rhetoric": "The art of effective or persuasive speaking or writing.",
    "synthesis": "The combination of components to form a connected whole.",
    "theorem": "A general proposition not self-evident but proved by reasoning.",
    "ubiquitous": "Present, appearing, or found everywhere.",
    "velocity": "The speed of something in a given direction.",
    "wavelength": "The distance between successive crests of a wave.",
    "xenophobia": "Dislike of or prejudice against people from other countries.",
    "yield": "Produce or provide a natural, agricultural, or industrial product.",
    "zephyr": "A gentle, mild breeze."
}